app/views/admin/routes/_form.html.erb

SELECT "railway_stations".* FROM "railway_stations"
---
    <%= f.label :railway_station_ids, "Current station" %>
    <%= f.collection_select :railway_station_ids, RailwayStation.all, :id, :title, {}, { multiple: true } %>