app/views/admin/routes/show.html.erb

SELECT  1 AS one FROM "trains" WHERE "trains"."route_id" = ? LIMIT ?  [["route_id", 8], ["LIMIT", 1]]
SELECT "trains".* FROM "trains" WHERE "trains"."route_id" = ?  [["route_id", 2]]
---
<p>
  <% if @route.trains.empty? %>