app/views/trains/_form.html.erb

    <%= f.label :current_station, "Current station" %>
    <%= f.collection_select :current_station_id, RailwayStation.all, :id, :title %>
---
SELECT "railway_stations".* FROM "railway_stations"

    <%= f.label :route, "Train's route" %>
    <%= f.collection_select :route_id, Route.all, :id, :name %>
---
SELECT "routes".* FROM "routes"