app/views/trains/show.html.erb

SELECT  "routes".* FROM "routes" WHERE "routes"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
---
  <strong>Train's route:</strong>
  <% if @train.route.present? %>

SELECT  "cars".* FROM "cars" WHERE "cars"."train_id" = ? ORDER BY "cars"."id" ASC LIMIT ?  [["train_id", 1], ["LIMIT", 1]]
---
<p>
  <% if @train.cars.present? %>