app/controllers/admin/cars_controller.rb

SELECT  "trains".* FROM "trains" WHERE "trains"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def new
    @train = Train.find(params[:train_id])

INSERT INTO "cars" ("car_type", "up_space", "low_space", "created_at", "updated_at", "train_id", "number", "side_up_space", "side_low_space", "seat_space") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?)
---
  def create
    @car = @train.cars.new(car_params)
    if @car.save

SELECT  "trains".* FROM "trains" WHERE "trains"."id" = ? LIMIT ?  [["id", 5], ["LIMIT", 1]]
---
    def set_train
      @train = Train.find(params[:train_id])