app/controllers/admin/railway_stations_controller.rb

SELECT "railway_stations".* FROM "railway_stations"
---
  def index
    @railway_stations = RailwayStation.all

INSERT INTO "railway_stations" ("title", "created_at", "updated_at") VALUES (?, ?, ?)  [["title", "Syrgyt"], ["created_at", 2016-12-07 16:52:27 UTC], ["updated_at", 2016-12-07 16:52:27 UTC]]
---
  def create
    @railway_station = RailwayStation.new(railway_station_params)
    if @railway_station.save

DELETE FROM "railway_stations" WHERE "railway_stations"."id" = ?  [["id", 6]]
---
  def destroy
    @railway_station.destroy

SELECT  "routes".* FROM "routes" WHERE "routes"."id" = ? LIMIT ?  [["id", 8], ["LIMIT", 1]]
---
  def update_station_order
    @route=Route.find(params[:route_id])

SELECT  "railway_stations".* FROM "railway_stations" WHERE "railway_stations"."id" = ? LIMIT ?  [["id", 6], ["LIMIT", 1]]
---
    def set_railway_station
      @railway_station = RailwayStation.find(params[:id])