app/controllers/admin/routes_controller.rb

  def index
    @routes = Route.all
---
SELECT "routes".* FROM "routes"

  def update
    if @route.update(route_params)
---
UPDATE "routes" SET "name" = ?, "updated_at" = ? WHERE "routes"."id" = ?  [["name", "Moscow - Kazan"], ["updated_at", 2016-12-07 17:13:19 UTC], ["id", 8]]

  def set_route
    @route = Route.find(params[:id])
---
SELECT  "routes".* FROM "routes" WHERE "routes"."id" = ? LIMIT ?  [["id", 8], ["LIMIT", 1]]