app/controllers/admin/tickets_controller.rb

  def destroy
    Ticket.find(params[:id]).destroy
---
DELETE FROM "tickets" WHERE "tickets"."id" = ?  [["id", 6]]
SELECT  "tickets".* FROM "tickets" WHERE "tickets"."id" = ? LIMIT ?  [["id", 6], ["LIMIT", 1]]

  def create
    @ticket = Ticket.new(ticket_params)
    if @ticket.save
---
INSERT INTO "tickets" ("created_at", "updated_at", "user_id", "train_id", "start_station_id", "end_station_id", "pas_name", "pas_pasport") VALUES (?, ?, ?, ?, ?, ?, ?, ?)