app/controllers/admin/trains_controller.rb

SELECT "trains".* FROM "trains"
---
  def index
    @trains = Train.all

INSERT INTO "trains" ("number", "created_at", "updated_at", "current_station_id", "route_id") VALUES (?, ?, ?, ?, ?)  [["number", "264236"], ["created_at", 2016-12-07 17:02:27 UTC], ["updated_at", 2016-12-07 17:02:27 UTC], ["current_station_id", 5], ["route_id", 8]]
---
  def create
    @train = Train.new(train_params)
    if @train.save

DELETE FROM "trains" WHERE "trains"."id" = ?  [["id", 5]]
---
  def destroy
    @train.destroy

SELECT  "trains".* FROM "trains" WHERE "trains"."id" = ? LIMIT ?  [["id", 5], ["LIMIT", 1]]
---
    def set_train
      @train = Train.find(params[:id])