app/views/admin/tickets/_form.html.erb

SELECT "users".* FROM "users"
---
    <%= f.label :user_id, "Who will get the ticket" %>
    <%= f.collection_select :user_id, User.all, :id, :email %>