app/views/searches/show.html.erb

    <%= f.label :start_station_id, "Start station" %>
    <%= f.collection_select :start_station_id, RailwayStation.all, :id, :title %>
---
SELECT "railway_stations".* FROM "railway_stations"