app/controllers/cars_controller.rb

  def new
    @train = Train.find(params[:train_id])
---
SELECT  "trains".* FROM "trains" WHERE "trains"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]

  def create
    @car = @train.cars.new(car_params)
    if @car.save
---
INSERT INTO "cars" ("car_type", "up_space", "low_space", "created_at", "updated_at", "train_id", "number") VALUES (?, ?, ?, ?, ?, ?, ?)  [["car_type", "plazkart"], ["up_space", 123], ["low_space", 321], ["created_at", 2016-12-04 12:20:43 UTC], ["updated_at", 2016-12-04 12:20:43 UTC], ["train_id", 1], ["number", 1]]

  def update
    if @car.update(car_params)
---
UPDATE "cars" SET "up_space" = ?, "low_space" = ?, "side_up_space" = ?, "side_low_space" = ?, "updated_at" = ? WHERE "cars"."id" = ?  [["up_space", 1], ["low_space", 1], ["side_up_space", 1], ["side_low_space", 1], ["updated_at", 2016-12-04 13:43:14 UTC], ["id", 6]]

    def set_train
      @train = Train.find(params[:train_id])
---
SELECT  "trains".* FROM "trains" WHERE "trains"."id" = ? LIMIT ?  [["id", nil], ["LIMIT", 1]]