app/controllers/railway_stations_controller.rb

  def index
    @railway_stations = RailwayStation.all
---
SELECT "railway_stations".* FROM "railway_stations"

  def create
    @railway_station = RailwayStation.new(railway_station_params)
    if @railway_station.save
---
INSERT INTO "railway_stations" ("title", "created_at", "updated_at") VALUES (?, ?, ?)  [["title", "Moscow"], ["created_at", 2016-11-28 17:23:44 UTC], ["updated_at", 2016-11-28 17:23:44 UTC]]

  def update_station_order
    @route=Route.find(params[:route_id])
---
SELECT  "routes".* FROM "routes" WHERE "routes"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]

  def update_time
    @route=Route.find(params[:route_id])
---
SELECT  "routes".* FROM "routes" WHERE "routes"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]

    def set_railway_station
      @railway_station = RailwayStation.find(params[:id])
---
SELECT  "railway_stations".* FROM "railway_stations" WHERE "railway_stations"."id" = ? LIMIT ?  [["id", 4], ["LIMIT", 1]]