app/controllers/routes_controller.rb

SELECT "routes".* FROM "routes"
---
  def index
    @routes = Route.all

INSERT INTO "routes" ("name", "created_at", "updated_at") VALUES (?, ?, ?)  [["name", "asd"], ["created_at", 2016-11-29 17:43:57 UTC], ["updated_at", 2016-11-29 17:43:57 UTC]]
---
  def create
    @route = Route.new(route_params)
    if @route.save

UPDATE "routes" SET "name" = ?, "updated_at" = ? WHERE "routes"."id" = ?  [["name", "1436476"], ["updated_at", 2016-11-29 17:47:44 UTC], ["id", 1]]
---
  def update
    if @route.update(route_params)

DELETE FROM "routes" WHERE "routes"."id" = ?  [["id", 1]]
---
  def destroy
    @route.destroy

SELECT  "routes".* FROM "routes" WHERE "routes"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def set_route
    @route = Route.find(params[:id])