app/controllers/tickets_controller.rb

  def index
    if current_user.admin?
      @tickets =Ticket.all
---
SELECT "tickets".* FROM "tickets"

  def create
    @ticket = current_user.tickets.new(ticket_params)
    if @ticket.save
---
INSERT INTO "tickets" ("created_at", "updated_at", "user_id", "train_id", "start_station_id", "end_station_id", "pas_name", "pas_pasport") VALUES (?, ?, ?, ?, ?, ?, ?, ?)

  def destroy
    current_user.tickets.find(params[:id]).destroy
---
DELETE FROM "tickets" WHERE "tickets"."id" = ?  [["id", 3]]
SELECT  "tickets".* FROM "tickets" WHERE "tickets"."user_id" = ? AND "tickets"."id" = ? LIMIT ?  [["user_id", 5], ["id", 3], ["LIMIT", 1]]

  def update
    if @ticket.update(ticket_params)
---
UPDATE "tickets" SET "pas_name" = ?, "pas_pasport" = ?, "updated_at" = ? WHERE "tickets"."id" = ?  [["pas_name", "1234576"], ["pas_pasport", "12312"], ["updated_at", 2016-12-07 17:57:24 UTC], ["id", 2]]