app/controllers/trains_controller.rb

  def index
    @trains = Train.all
---
SELECT "trains".* FROM "trains"

  def create
    @train = Train.new(train_params)
    if @train.save
---
INSERT INTO "trains" ("number", "created_at", "updated_at", "current_station_id", "route_id") VALUES (?, ?, ?, ?, ?)  [["number", "999"], ["created_at", 2016-12-01 18:07:26 UTC], ["updated_at", 2016-12-01 18:07:26 UTC], ["current_station_id", 1], ["route_id", 2]]

  def update
    if @train.update(train_params)
---
UPDATE "trains" SET "current_station_id" = ?, "route_id" = ?, "updated_at" = ? WHERE "trains"."id" = ?  [["current_station_id", 1], ["route_id", 2], ["updated_at", 2016-12-04 14:34:59 UTC], ["id", 3]]

    def set_train
      @train = Train.find(params[:id])
---
SELECT  "trains".* FROM "trains" WHERE "trains"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]