app/views/routes/_form.html.erb

    <%= f.label :railway_station_ids, "Current station" %>
    <%= f.collection_select :railway_station_ids, RailwayStation.all, :id, :title, {}, { multiple: true } %>
---
SELECT "railway_stations".* FROM "railway_stations"