app/views/admin/trains/_form.html.erb

SELECT "railway_stations".* FROM "railway_stations"
---
    <%= f.label :current_station, "Current station" %>
    <%= f.collection_select :current_station_id, RailwayStation.all, :id, :title %>

SELECT "routes".* FROM "routes"
---
    <%= f.label :route, "Train's route" %>
    <%= f.collection_select :route_id, Route.all, :id, :name %>