app/views/admin/trains/show.html.erb

  <strong>Train's route:</strong>
  <% if @train.route.present? %>
---
SELECT  "routes".* FROM "routes" WHERE "routes"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]

<p>
  <% if @train.cars.present? %>
---
SELECT "cars".* FROM "cars" WHERE "cars"."train_id" = ? ORDER BY number DESC  [["train_id", 1]]