app/views/cars/_form.html.erb

    <%= f.label :train, "Train, where u add this car" %>
    <%= f.collection_select :train_id, Train.all, :id, :number %>
---
SELECT "trains".* FROM "trains"